rails_space/chapter5_finish/app/controllers/user_controller.rb

INSERT INTO "users" ("updated_at", "screen_name", "password", "email", "created_at") VALUES('2009-01-31 16:28:59', 'fred', 'fred', 'fred@blah.com', '2009-01-31 16:28:59')
---
  def register
    @title = "Register"
    if request.post? and params[:user]
      # Output goes to log file (logs/development.log in development mode)
      logger.info params[:user].inspect
      @user = User.new(params[:user])
      if @user.save