rails_space/chapter6_finish/app/controllers/user_controller.rb

INSERT INTO "users" ("updated_at", "screen_name", "password", "email", "created_at") VALUES('2009-01-31 16:55:49', 'new_screen_name', 'long_enough_password', 'valid@example.com', '2009-01-31 16:55:49')
---
  def register
    @title = "Register"
    if request.post? and params[:user]
      @user = User.new(params[:user])
      if @user.save

SELECT * FROM "users" WHERE ("users"."password" = 'long_enough_password' AND "users"."screen_name" = 'new_screen_name') LIMIT 1
---
  def login
    @title = "Log in to RailsSpace"
    if request.post? and params[:user]
      @user = User.new(params[:user])
      user = User.find_by_screen_name_and_password(@user.screen_name, @user.password)